{
"About": {
  "Name": "Luca Benoit",
  "Currently": "Electrical Engineering Student",
  "Headshot": "student-portrait.png",
  "Thumbnail": "student-logo.webp",
  "AboutText": "Hi, I am Luca Benoit. I am a passionate electrical engineering student with a keen interest in sustainable energy alternatives. Currently, I am pursuing my undergraduate degree at Seattle Pacific University. I am dedicated to expanding my knowledge and skills in various areas of electrical engineering, with a particular focus on power systems.<br><br>I enjoy tackling challenging projects and I thrive in collaborative environments where I can contribute my expertise and learn from my peers.<br><br>I believe in the importance of continuous learning and seek out opportunities to explore new technologies and methodologies."
},
"Contact": {
  "EMail": "benoitd@spu.edu",
  "Phone": "...",
  "Portfolio": "https://www.github.com",
  "LinkedIn": "https://www.linkedin.com/in/luca-benoit-730134276/",
  "GitHub": "https://www.github.com"
},
"Experience": {
  "ExperienceText": "I am a senior Electrical Engineering student.<br><br>As of now, I've worked on several projects relating to analog filtering, R&D, PCB design for power electronics, and power systems.",
  "School": "Seattle Pacific University",
  "Major": "Electrical Engineering",
  "Graduation": "Expected June 2026",
  "EducationText": "As part of the Electrical Engineering curriculum at SPU, I've been exposed to several learning opportunities related to most of the projects I've worked on.<br><br>Some of my most notable projects relate to power systems for microgrids, PCB design, Power Electronics, and analog filtering.",
  "Employment": "Seattle Pacific University",
  "Role": "Research and Development Intern",
  "EmploymentText": "I worked on designing and prototyping a wearable temperature and hydration level monitoring system used for research in human locomotion energetics. My activities included circuit design, integration of temperature and humidity sensors with an ESP32 microcontroller, and development of firmware for real-time data acquisition. In addition, I was responsible for the power management system, which involved sizing the battery for the desired runtime as well as integrating the charge controller circuit and power distribution unit for the other sensors in the wearable.",
  "Skills": ["Hardware: Oscilloscope, multimeter, power supply, signal generator<br><br>Software: MATLAB, Altium Designer, Python (MicroPython, CircuitPython), C++<br><br>Microcontrollers: Raspberry Pi, Arduino, ESP32<br><br>Simulation/Design: Multisim, LTspice "],
  "SkillsText": "",
  "Resume": ""  
},
"Project1": {
    "Title": "Frequency Detection Design Project",
    "Desc": "The goal of this project was to design a system that transmits and receives three audio frequency signal transmitted and received via modulation on infrared (IR) signals to turn on an LED at a specific frequency. Any combination of these three frequencies (10 kHz, 17 kHz, and 25 kHz) may be on at a given time.<br><br>The screenshots illustrates the design process:<br><br>1. Designing the filter in Multisim.<br><br>2. Bode Plot of the filter.<br><br>3. Frequency Response Analysis of the physical circuit.<br><br>4. Filter Output (All three frequencies on).<br><br>5. Filter Output (Only stopping frequencies, 10 and 25 kHz)<br><br>6. Filter with Peak Detector.<br><br>7. Peak detector output (All three frequencies).<br><br>8. Peak detector output (Only stopping frequencies).",
    "GitHubRepo": "",
    "MainImage": "P1Main.png",
    "DetailImages": ["P1Main.png","BodePlot_DesignProject.png","FRA_DesignProject.jpg","3freqOn_DesignProject.jpg","StoppingFreqOn_DesignProject.jpg","FilterAndPeakDetector_DesignProject.jpg","PeakDetectorOutput3Freq_DesignProject.jpg","PeakDetectorOutputStoppingOnly_DesignProject.jpg"]
  },
  "Project2": {
    "Title": "Samll-Scale Pumping Kite AWES",
    "Desc": "For this project, my team and I are developing a small-scale pumpign kite AWES system, a type of wind energy generator that uses a kite to harness wind energy and generate electricity.",
    "GitHubRepo": "",
    "MainImage": "SystemDesign_edited.png",
    "DetailImages": ["SystemDesign_edited.png","AWES_conceptSketch.jpg"]
  },
  "Project3": {
    "Title": "",
    "Desc": "",
    "GitHubRepo": "",
    "MainImage": "",
    "DetailImages": []
  },
  "Project4": {
    "Title": "",
    "Desc": "",
    "GitHubRepo": "",
    "MainImage": "",
    "DetailImages": []
  }
}
